---
kind: method
id: M:Autodesk.Revit.DB.EdgeEndPoint.Equals(Autodesk.Revit.DB.EdgeEndPoint)
source: html/36cc5cf4-d6a1-335e-7399-5ddd9d1b275d.htm
---
# Autodesk.Revit.DB.EdgeEndPoint.Equals Method

Determines whether this EdgeEndPoint is equal to another.

## Syntax (C#)
```csharp
public bool Equals(
	EdgeEndPoint other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.EdgeEndPoint`) - The EdgeEndPoint with which to compare this EdgeEndPoint.

## Returns
True if the given EdgeEndPoint is equal to this one, otherwise false.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null